MSDFAR/dfar_ms/backend/config/main.php

SELECT * FROM `profile_officer` WHERE `id`=418
---
     * Existing password-reset logic.
     */
    if (!Yii::$app->user->isGuest) {
        $officer = ProfileOfficer::findOne(
            Yii::$app->user->identity->profile_id
        );