MSDFAR/dfar_ms/backend/views/layouts/main.php

$profile = "";
//$profileExport="";
if (!Yii::$app->user->isGuest && (!UserTypeUtil::hasType(Constant::FISHERMAN) || UserTypeUtil::isDirector())) {
    $profile = ProfileOfficers::findOne(Yii::$app->user->identity->profile_id);
---
SELECT * FROM `profile_officer` WHERE `id`=418