MSDFAR/dfar_ms/backend/controllers/SiteController.php

SELECT * FROM `profile_officer` WHERE `id`=5
---
                    Constant::EXPORT_COMPANY
                )
            ) {
                $profile = ProfileOfficer::findOne(Yii::$app->user->identity->profile_id);

SELECT * FROM `system_flags` WHERE `key`='daily_task'
UPDATE `system_flags` SET `value`='2026-09-29' WHERE `key`='daily_task'
---
    function runOncePerDay()
    {
        $key = 'daily_task';
        $today = date('Y-m-d');

        $row = (new Query())
            ->from('system_flags')
            ->where(['key' => $key])
            ->one();

        if ($row && $row['value'] === $today) {
            return false; // already ran today
        }

        // ✅ Your logic here
        Yii::info("Running task...");
        BoatRegistrationController::markeAsExpired();
        HighseasLicenseController::markeAsExpired();
        NationalLicenseController::markeAsExpired();
        FishermanController::markeAsExpired();
        DepartureBoatController::markeAsAllowed();
        DepartureBoatController::markeAsServicepending();


        if ($row) {
            Yii::$app->db->createCommand()->update('system_flags', [
                'value' => $today
            ], ['key' => $key])->execute();